ERP.belugaerp/src/Documents/битРасчетАвансовПоАкцизам/битРасчетАвансовПоАкцизам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битРасчетАвансовПоАкцизам</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностям</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.бг_ОперацииРасчетаАвансовПоАкцизам</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректируемыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Акцизы</name>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>DocumentRef.битРасчетАвансовПоАкцизам</types>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НалоговаяСтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАвансаИсходное</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродажаНаЭкспорт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодНачисленияАванса</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРеализации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/AccumulationRegisters/бг_АкцизПоПриобретеннымЦенностям/бг_АкцизПоПриобретеннымЦенностям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>бг_АкцизПоПриобретеннымЦенностям</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.битРасчетАвансовПоАкцизам</types>
      <types>CatalogRef.бг_БанковскиеГарантии</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеСырья</name>
    <type>
      <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеОплатыАванса</name>
    <type>
      <types>CatalogRef.бг_СостоянияОплатыАванса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусАкциза</name>
    <type>
      <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияПродукции</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP.belugaerp/src/Enums/бг_ОперацииРасчетаАвансовПоАкцизам/бг_ОперацииРасчетаАвансовПоАкцизам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ОперацииРасчетаАвансовПоАкцизам</name>
  <enumValues>
    <name>РасчетАвансов</name>
  </enumValues>
  <enumValues>
    <name>РасчетВозмещенияАвансов</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_СтатусыНачисленияАвансов/бг_СтатусыНачисленияАвансов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СтатусыНачисленияАвансов</name>
  <enumValues>
    <name>НачисленАванс</name>
  </enumValues>
  <enumValues>
    <name>ОформленВычет</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Catalogs/бг_СостоянияОплатыАванса/бг_СостоянияОплатыАванса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бг_СостоянияОплатыАванса</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.бг_СтатусыНачисленияАвансов</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродажаНаЭкспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Documents/битРасчетАвансовПоАкцизам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ОбработкаЗаполнения")
Процедура бг_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ИнициализироватьДокумент();
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура бг_ОбработкаПроведения(Отказ, РежимПроведения)
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	ДатаРасчета = ?(Корректировка, КорректируемыйПериод, Дата);
	Обработки.бг_АктуализацияДвиженийПоАкцизам.ВосстановитьПоследовательностьДвижений(
										АналитикиОтрицательныеОстаткиПоАкцизам(),
										ДатаРасчета,
										'00010101');
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура бг_ОбработкаУдаленияПроведения(Отказ)
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
	Обработки.бг_АктуализацияДвиженийПоАкцизам.ВосстановитьПоследовательностьДвижений(
										АналитикиОтрицательныеОстаткиПоАкцизам(),
										Дата,
										'00010101');
КонецПроцедуры

&После("ПередЗаписью")
Процедура бг_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	СуммаДокумента = Документы.битРасчетАвансовПоАкцизам.ПолучитьСуммуДокумента(ЭтотОбъект);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ЗаполнитьСостоянияОплатыРасчетовАванса();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция АналитикиОтрицательныеОстаткиПоАкцизам()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АкцизОстатки.Организация КАК Организация,
	|	АкцизОстатки.Номенклатура КАК Номенклатура,
	|	АкцизОстатки.СерияНоменклатуры КАК СерияНоменклатуры,
	|	АкцизОстатки.Сделка КАК Сделка,
	|	АкцизОстатки.СостояниеСырья КАК СостояниеСырья,
	|	АкцизОстатки.СостояниеОплатыАванса КАК СостояниеОплатыАванса,
	|	АкцизОстатки.СтатусАкциза КАК СтатусАкциза,
	|	АкцизОстатки.Продукция КАК Продукция,
	|	АкцизОстатки.СерияПродукции КАК СерияПродукции,
	|	АкцизОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Остатки(, ) КАК АкцизОстатки
	|ГДЕ
	|	АкцизОстатки.КоличествоОстаток < 0";
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
КонецФункции

Процедура ИнициализироватьДокумент()
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ЗаполнитьСостоянияОплатыРасчетовАванса()
	КэшСостоянияОплаты = Новый ТаблицаЗначений;
	КэшСостоянияОплаты.Колонки.Добавить("НалоговаяСтавка", ОбщегоНазначения.ОписаниеТипаЧисло(6));
	КэшСостоянияОплаты.Колонки.Добавить("ПродажаНаЭкспорт", Новый ОписаниеТипов("Булево"));
	КэшСостоянияОплаты.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	КэшСостоянияОплаты.Колонки.Добавить("СостояниеОплатыАванса", Новый ОписаниеТипов("СправочникСсылка.бг_СостоянияОплатыАванса"));
	
	Если ХозяйственнаяОперация = Перечисления.бг_ОперацииРасчетаАвансовПоАкцизам.РасчетАвансов Тогда
		СтатусНачисления = Перечисления.бг_СтатусыНачисленияАвансов.НачисленАванс;
	Иначе
		СтатусНачисления = Перечисления.бг_СтатусыНачисленияАвансов.ОформленВычет;
	КонецЕсли;
	
	Для Каждого СтрокаАкциз Из Акцизы Цикл
		Если ХозяйственнаяОперация = Перечисления.бг_ОперацииРасчетаАвансовПоАкцизам.РасчетАвансов Тогда
			СтрокаАкциз.ПериодНачисленияАванса = ?(Корректировка, КорректируемыйПериод, Дата);;
		КонецЕсли;
		
		СостояниеОплаты = СостояниеОплаты(КэшСостоянияОплаты, СтатусНачисления,
						СтрокаАкциз.НалоговаяСтавка, СтрокаАкциз.ПродажаНаЭкспорт, СтрокаАкциз.ПериодНачисленияАванса);
		СтрокаАкциз.СостояниеОплатыАванса = СостояниеОплаты;
	КонецЦикла;
КонецПроцедуры

Функция СостояниеОплаты(КэшСостоянияОплаты, СтатусНачисления, НалоговаяСтавка, ПродажаНаЭкспорт, Период)
	Отбор = Новый Структура("НалоговаяСтавка, ПродажаНаЭкспорт, Период", НалоговаяСтавка, ПродажаНаЭкспорт, Период);
	
	СтрокиКэш = КэшСостоянияОплаты.НайтиСтроки(Отбор);
	Если СтрокиКэш.Количество() > 0 Тогда
		Возврат СтрокиКэш[0].СостояниеОплатыАванса;
	КонецЕсли;
	
	СостояниеОплаты = Справочники.бг_СостоянияОплатыАванса.СостояниеОплатыАванса(Период, СтатусНачисления, НалоговаяСтавка, ПродажаНаЭкспорт);
	
	НоваяСтрокаКэш = КэшСостоянияОплаты.Добавить();
	НоваяСтрокаКэш.НалоговаяСтавка       = НалоговаяСтавка;
	НоваяСтрокаКэш.ПродажаНаЭкспорт      = ПродажаНаЭкспорт;
	НоваяСтрокаКэш.Период                = Период;
	НоваяСтрокаКэш.СостояниеОплатыАванса = СостояниеОплаты;
	
	Возврат СостояниеОплаты;
КонецФункции

#КонецОбласти

#КонецЕсли
